adamkondraciuk/nrfx/mdk/nrf54h20_engb_bbpr.svd
        <register>
          <name>DIEPEMPMSK</name>
          <description>Device IN Endpoint FIFO Empty Interrupt Mask Register</description>
          <addressOffset>0x834</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INEPTXFEMPMSK</name>
              <description>IN EP Tx FIFO Empty Interrupt Mask Bits (InEpTxfEmpMsk)</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EP0_MASK</name>
                  <description>Mask IN EP0 Tx FIFO Empty Interrupt</description>
                  <value>0x0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP1_MASK</name>
                  <description>Mask IN EP1 Tx FIFO Empty Interrupt</description>
                  <value>0x0002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP2_MASK</name>
                  <description>Mask IN EP2 Tx FIFO Empty Interrupt</description>
                  <value>0x0004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP3_MASK</name>
                  <description>Mask IN EP3 Tx FIFO Empty Interrupt</description>
                  <value>0x0008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP4_MASK</name>
                  <description>Mask IN EP4 Tx FIFO Empty Interrupt</description>
                  <value>0x0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP5_MASK</name>
                  <description>Mask IN EP5 Tx FIFO Empty Interrupt</description>
                  <value>0x0020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP6_MASK</name>
                  <description>Mask IN EP6 Tx FIFO Empty Interrupt</description>
                  <value>0x0040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP7_MASK</name>
                  <description>Mask IN EP7 Tx FIFO Empty Interrupt</description>
                  <value>0x0080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP8_MASK</name>
                  <description>Mask IN EP8 Tx FIFO Empty Interrupt</description>
                  <value>0x0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP9_MASK</name>
                  <description>Mask IN EP9 Tx FIFO Empty Interrupt</description>
                  <value>0x0200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP10_MASK</name>
                  <description>Mask IN EP10 Tx FIFO Empty Interrupt</description>
                  <value>0x0400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP11_MASK</name>
                  <description>Mask IN EP11 Tx FIFO Empty Interrupt</description>
                  <value>0x0800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP12_MASK</name>
                  <description>Mask IN EP12 Tx FIFO Empty Interrupt</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP13_MASK</name>
                  <description>Mask IN EP13 Tx FIFO Empty Interrupt</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP14_MASK</name>
                  <description>Mask IN EP14 Tx FIFO Empty Interrupt</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EP15_MASK</name>
                  <description>Mask IN EP15 Tx FIFO Empty Interrupt</description>
                  <value>0x8000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL0</name>
          <description>Device Control IN Endpoint 0 Control Register</description>
          <addressOffset>0x900</addressOffset>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MPS</name>
              <description>Maximum Packet Size (MPS)</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTES64</name>
                  <description>64 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTES32</name>
                  <description>32 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTES16</name>
                  <description>16 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTES8</name>
                  <description>8 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBACTEP</name>
              <description>USB Active Endpoint (USBActEP)</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE0</name>
                  <description>Control endpoint is always active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAK Status (NAKSts)</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>The core is transmitting non-NAK handshakes based on the FIFO status</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>The core is transmitting NAK handshakes on this endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type (EPType)</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Endpoint Control 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL Handshake (Stall)</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Stall</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Stall Handshake</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TxFIFO Number (TxFNum)</description>
              <lsb>22</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXFIFO0</name>
                  <description>Tx FIFO 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO1</name>
                  <description>Tx FIFO 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO2</name>
                  <description>Tx FIFO 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO3</name>
                  <description>Tx FIFO 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO4</name>
                  <description>Tx FIFO 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO5</name>
                  <description>Tx FIFO 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO6</name>
                  <description>Tx FIFO 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO7</name>
                  <description>Tx FIFO 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO8</name>
                  <description>Tx FIFO 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO9</name>
                  <description>Tx FIFO 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO10</name>
                  <description>Tx FIFO 10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO11</name>
                  <description>Tx FIFO 11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO12</name>
                  <description>Tx FIFO 12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO13</name>
                  <description>Tx FIFO 13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO14</name>
                  <description>Tx FIFO 14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO15</name>
                  <description>Tx FIFO 15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNAK</name>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCLEAR</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear NAK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNAK</name>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSET</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set NAK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint Disable (EPDis)</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Disabled Endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint Enable (EPEna)</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Enable Endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
