adamkondraciuk/nrfx/mdk/nrf54h20_engb_bbpr.svd
        <cluster>
          <name>EXTCONF2</name>
          <description>Configuration for external memory device 2.</description>
          <headerStructName>EXTCONF2</headerStructName>
          <alternateCluster>EXTCONF1</alternateCluster>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>OFFSET</name>
            <description>Address offset for external memory device 2.</description>
            <addressOffset>0x8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSET</name>
                <description>External memory Offset.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZE</name>
            <description>Upper address range for external memory device 2.</description>
            <addressOffset>0xC</addressOffset>
            <access>read-write</access>
            <resetValue>0x0FFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SIZE</name>
                <description>Upper limit address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ENABLE</name>
            <description>Enable or disable external memory access.</description>
            <addressOffset>0x20</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable or disable external memory access from AXI interface.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable external memory.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable external memory.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CORE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_EXMIF_CORE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <cluster>
            <name>SSICADDRESS</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_EXMIF_CORE_SSICADDRESS</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>CTRLR0</name>
              <description>This register controls the serial data transfer.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00004007</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DFS</name>
                  <description>Data Frame Size.</description>
                  <lsb>0</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DFS_01_BIT</name>
                      <description>Unspecified</description>
                      <value>0x00</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_02_BIT</name>
                      <description>Unspecified</description>
                      <value>0x01</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_03_BIT</name>
                      <description>Unspecified</description>
                      <value>0x02</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_04_BIT</name>
                      <description>Unspecified</description>
                      <value>0x03</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_05_BIT</name>
                      <description>Unspecified</description>
                      <value>0x04</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_06_BIT</name>
                      <description>Unspecified</description>
                      <value>0x05</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_07_BIT</name>
                      <description>Unspecified</description>
                      <value>0x06</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_08_BIT</name>
                      <description>Unspecified</description>
                      <value>0x07</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_09_BIT</name>
                      <description>Unspecified</description>
                      <value>0x08</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_10_BIT</name>
                      <description>Unspecified</description>
                      <value>0x09</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_11_BIT</name>
                      <description>Unspecified</description>
                      <value>0x0A</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_12_BIT</name>
                      <description>Unspecified</description>
                      <value>0x0B</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_13_BIT</name>
                      <description>Unspecified</description>
                      <value>0x0C</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_14_BIT</name>
                      <description>Unspecified</description>
                      <value>0x0D</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_15_BIT</name>
                      <description>Unspecified</description>
                      <value>0x0E</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_16_BIT</name>
                      <description>Unspecified</description>
                      <value>0x0F</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_17_BIT</name>
                      <description>Unspecified</description>
                      <value>0x10</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_18_BIT</name>
                      <description>Unspecified</description>
                      <value>0x11</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_19_BIT</name>
                      <description>Unspecified</description>
                      <value>0x12</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_20_BIT</name>
                      <description>Unspecified</description>
                      <value>0x13</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_21_BIT</name>
                      <description>Unspecified</description>
                      <value>0x14</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_22_BIT</name>
                      <description>Unspecified</description>
                      <value>0x15</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_23_BIT</name>
                      <description>Unspecified</description>
                      <value>0x16</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_24_BIT</name>
                      <description>Unspecified</description>
                      <value>0x17</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_25_BIT</name>
                      <description>Unspecified</description>
                      <value>0x18</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_26_BIT</name>
                      <description>Unspecified</description>
                      <value>0x19</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_27_BIT</name>
                      <description>Unspecified</description>
                      <value>0x1A</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_28_BIT</name>
                      <description>Unspecified</description>
                      <value>0x1B</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_29_BIT</name>
                      <description>Unspecified</description>
                      <value>0x1C</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_30_BIT</name>
                      <description>Unspecified</description>
                      <value>0x1D</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_31_BIT</name>
                      <description>Unspecified</description>
                      <value>0x1E</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DFS_32_BIT</name>
                      <description>Unspecified</description>
                      <value>0x1F</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>FRF</name>
                  <description>Frame Format.</description>
                  <lsb>6</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SPI</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SSP</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MICROWIRE</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SCPH</name>
                  <description>Serial Clock Phase.</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MIDDLE_BIT</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>START_BIT</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SCPOL</name>
                  <description>Serial Clock Polarity.</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE_HIGH</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INACTIVE_LOW</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TMOD</name>
                  <description>Transfer Mode.</description>
                  <lsb>10</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TX_AND_RX</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TX_ONLY</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RX_ONLY</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EEPROM_READ</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SLVOE</name>
                  <description>Slave Output Enable.</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SRL</name>
                  <description>Shift Register Loop.</description>
                  <lsb>13</lsb>
                  <msb>13</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NORMAL_MODE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TESTING_MODE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SSTE</name>
                  <description>Slave Select Toggle Enable.</description>
                  <lsb>14</lsb>
                  <msb>14</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TOGGLE_DISABLE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TOGGLE_EN</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CFS</name>
                  <description>Control Frame Size.</description>
                  <lsb>16</lsb>
                  <msb>19</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SIZE_01_BIT</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_02_BIT</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_03_BIT</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_04_BIT</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_05_BIT</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_06_BIT</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_07_BIT</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_08_BIT</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_09_BIT</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_10_BIT</name>
                      <description>Unspecified</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_11_BIT</name>
                      <description>Unspecified</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_12_BIT</name>
                      <description>Unspecified</description>
                      <value>0xB</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_13_BIT</name>
                      <description>Unspecified</description>
                      <value>0xC</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_14_BIT</name>
                      <description>Unspecified</description>
                      <value>0xD</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_15_BIT</name>
                      <description>Unspecified</description>
                      <value>0xE</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIZE_16_BIT</name>
                      <description>Unspecified</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SPIFRF</name>
                  <description>SPI Frame Format</description>
                  <lsb>22</lsb>
                  <msb>23</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SPI_STANDARD</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_DUAL</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_QUAD</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_OCTAL</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SPIHYPERBUSEN</name>
                  <description>SPI Hyperbus Frame format enable.</description>
                  <lsb>24</lsb>
                  <msb>24</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SPIDWSEN</name>
                  <description>Enable Dynamic wait states in SPI mode of operation.</description>
                  <lsb>25</lsb>
                  <msb>25</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SSIISMST</name>
                  <description>This field selects if DWC_ssi is working in Master or Slave mode</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SLAVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
